{
  "departure": "Tirana",
  "arrival": "Amsterdam",
  "cities": [
    {
      "id": 0,
      "cityName": "Tirana",
      "latitude": 41.3311551,
      "longtitude": 19.6777386,
      "description": [
        {
          "general": "Tirana is the capital city of Albania. Positioned in the heart of Albania it's the largest city offering a variety of points of interests, cultural and historical spots. The city was established in 1614 by Sulejman Pasha Bargjini, a native feudal lord. On February 8, 1920 Tirana was made the temporary capital by the Congress of Lushnje, and it was proclaimed the permanent capital on December 31, 1925.",
          "history": "The area occupied by Tirana has been populated since the Paleolithic era, dating back 10,000 to 30,000 years ago, as suggested by evidence from tools excavated near Mount Dajt's quarry and in Pellumba Cave. As argued by various archaeologists, Tirana and its suburbs are filled with Illyrian toponyms, as its precincts are some of the earliest inhabited regions in Albania. The oldest discovery in downtown Tirana was a Roman house, later transformed into an aisleless church with a mosaic-floor, dating to the 3rd century A.D., with other remains found near a medieval temple at Shengjin Fountain in the eastern suburbs. A castle possibly called Tirkan or Theranda, whose remnants are found along Murat Toptani Street, was built by Emperor Justinian in 520 A.D. and restored by Ahmed Pasha Toptani in the 18th century. The area had no special importance in Illyrian and classical times. In 1510, Marin Barleti, an Albanian Catholic priest and scholar, in the biography of the Albanian national hero Skanderbeg, Historia de vita et gestis Scanderbegi Epirotarum principis (The story of life and deeds of Skanderbeg, the prince of Epirotes), referred to this area as a small village.",
          "geography": "Tirana is located in the central part of Albania, about 32 kilometers (20 mi) inland. Its average altitude is 110 meters (360 ft) above sea level and its highest point measures 1,828 metres (5,997 feet) at Mali me Gropa. The city is mostly surrounded by hills, with Dajti Mountain on the east and a slight valley opening on the north-west overlooking the Adriatic Sea in the distance. By road the city is 700 kilometres (430 miles) north of Athens, 290 km (180 mi) west of Skopje, 250 km (160 mi) south-east of Pristina and 160 km (99 mi) south of Podgorica. The Tiranë river runs through the city, as does the Lanë stream. Tirana has four artificial lakes, the Tirana Artificial Lake around which was built the Grand Park, Paskuqani Lake, Farka Lake, Tufina Lake and other smaller lakes or reservoirs. The present municipality was formed at the 2015 local government reform by the merger of the former municipalities Baldushk, Bërzhitë, Dajt, Farkë, Kashar, Krrabë, Ndroq, Petrelë, Pezë, Shëngjergj, Tirana, Vaqarr, Zall-Bastar and Zall-Herr, that became municipal units. The seat of the municipality is the city Tirana.",
          "climate": "Tirana has a humid subtropical climate (Cfa), and receives just enough summer precipitation to avoid Köppen's (Csa) Mediterranean climate classification, since every summer month has more than 40 millimetres (1.6 in) of rainfall, with hot and moderately dry/humid summers and cool and wet winters. Some snow falls almost every winter, but it usually melts quickly. The city is ranked in the Top 10 of the sunniest cities in Europe with a total of 2544 hours of sun.",
          "culture": "Tirana is an important center for music, film, theatre, dance and visual art. The city is host to the largest cultural institutions of the country, such as the National Theatre and the National Theatre of Opera and Ballet, the Natioan Archaeological Museum, the Art Gallery of Albania, the Sciences Museum of Albania and the National Historical Museum. Among the local institutions are the National Library, that keeps more than a million books, periodicals, maps, atlases, microfilms and other library materials. The city has five well-preserved traditional houses (museum-houses), 56 cultural monuments, eight public libraries. Since 2011, a Tourist Information Office was opened, located behind the National Historical Museum, with useful information about Tirana and Albania. The three main religions in Albania, which contains Islam, Orthodox and Catholic Christianity, have all their headquarters in Tirana. The Bektashi leadership moved to Albania and established their World Headquarters also in the city of Tirana. "
        }
      ],
      "photoLinks": [
        {
          "id": 0,
          "title": "University of Tirana",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Tirana%2C_palazzo_dell%27universit%C3%A0_15.JPG/320px-Tirana%2C_palazzo_dell%27universit%C3%A0_15.JPG"
        },
        {
          "id": 1,
          "title": "Skanderbeg Square Now",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Skanderbeg_square_tirana_2016.jpg/320px-Skanderbeg_square_tirana_2016.jpg"
        },
        {
          "id": 2,
          "title": "Old Bazar Now",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Pazari_i_ri.jpg/320px-Pazari_i_ri.jpg"
        },
        {
          "id": 3,
          "title": "Tirana River Back and Now",
          "link": "https://communityseverance.files.wordpress.com/2015/05/tirana5_2_3.jpeg"
        },
        {
          "id": 4,
          "title": "City Seal",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Stema_e_Bashkis%C3%AB_Tiran%C3%AB.svg/275px-Stema_e_Bashkis%C3%AB_Tiran%C3%AB.svg.png"
        }
      ]
    },
    {
      "id": 1,
      "cityName": "Podgorica",
      "latitude": 42.4321689,
      "longtitude": 19.1157944,
      "description": [
        {
          "general": "Podgorica is the capital and largest city of Montenegro. The city was also called Titograd  between 1946 and 1992 when Montenegro was part of the Socialist Federal Republic of Yugoslavia (SFRY).Podgorica's favourable position at the confluence of the Ribnica and Morača rivers and the meeting point of the fertile Zeta Plain and Bjelopavlići Valley has encouraged settlement. The city is close to winter ski centres in the north and seaside resorts on the Adriatic Sea. The city's population was 204,877 in the 2011 census. The Podgorica Municipality contains 10.4% of Montenegro's territory and 29.9% of its population. It is the administrative centre of Montenegro and its economic, cultural and educational focus.",
          "history": "Podgorica is at the crossroads of several historically important routes, near the rivers Zeta, Morača, Cijevna, Ribnica, Sitnica and Mareza in the valley of Lake Skadar and near the Adriatic Sea, in fertile lowlands with favourable climate. The earliest human settlements were in prehistory: the oldest physical remains are from the late Stone Age. In the Iron Age, the area between the Zeta and Bjelopavlići valleys was occupied by two Illyrian tribes, the Labeates and the Docleatae. The population of the town of Doclea was 8,000–10,000, in which all core urban issues were resolved. The high population density (in an area of about 10 km (6 mi) radius) was made possible by the geographical position, favourable climate and economic conditions and by the defensive positions that were of great importance at that time.",
          "geography": "Podgorica is located in central Montenegro. The area is crossed with rivers and the city itself is only 15 kilometres (9.3 mi) north of Lake Skadar. The Morača and Ribnica rivers flow through the city, while the Zeta, Cijevna, Sitnica and Mareza flow nearby. Morača is the largest river in the city, being 70 m or 230 ft wide near downtown, and having carved a 20 m or 66 ft deep canyon for the length of its course through the city. Except for the Morača and Zeta, other rivers have an appearance of small creeks. The richness in bodies of water is a major feature of the city. In contrast to most of Montenegro, Podgorica lies in a mainly flat area at the northern end of the Zeta plain, at an elevation of 40 m (130 ft). The only exceptions are hills which overlook the city. The most significant is 130.3 m (427 ft) high Gorica Hill, city's namesake, which rises above the city centre. The other hills include Malo brdo (little hill, 205.4 m or 674 ft), Velje brdo (big hill, 283 m or 928 ft), Ljubović (101 m or 331 ft) and Dajbabska gora (172 m or 564 ft). In the main, these are too steep for development and thus limit the city's expansion, especially to the north. However, urbanization has been encroaching on the lower slopes of the hills since the 1990s. Podgorica city proper has an area of 108 square kilometres (42 sq mi), while actual urbanized area is much smaller.",
          "climate": "Podgorica has a borderline Mediterranean climate (Csa) and humid subtropical climate (Cfa), since there is only one summer month with less than 40 millimeters (1.6 in) of precipitation,[3] with summer highs around 30 °C (86 °F) and winter highs around 10 °C (50 °F). Although the city is only some 35 km (22 mi) north of the Adriatic Sea, an arm of the Mediterranean, Rumija mountain acts as a natural Dinaric Alps barrier, separating Skadar Lake basin and Podgorica area from the sea, thus limiting temperate maritime influence on the local climate.",
          "culture": "Montenegrin cultural institutions and events. It hosts the Montenegrin National Theatre and a number of museums and galleries. The Montenegrin National Theatre is the most significant theatre not only in Podgorica but in all of Montenegro. Podgorica is also host to the City Theatre (Gradsko pozorište), which includes the Children's Theatre and the Puppet Theatre. Although not as rich in museums and galleries as the historic royal capital Cetinje, there are several noteworthy museums: 1)The Podgorica City Museum (Muzej grada Podgorice) preserves Podgorica's rich heritage. Founded in 1950, it has four categories: archaeological, ethnographic, historical and cultural-historical. It houses artifacts which date back to the Roman and Illyrian eras. 2)The Archaeological Research Centre (Centar za arheološka istraživanja) was founded in 1961. Its mission is to gather, classify, restore and display archaeological sites. 3)The Marko Miljanov Museum (Muzej Marka Miljanova) in Medun shows life in 19th century Montenegro. It is the most significant Montenegrin memorial museum of its kind. 4)The Natural History Museum (Prirodnjački muzej) displays specimens of Montenegrin flora and fauna. This museum has no exhibition space of its own, despite many proposals and initiatives to build one. There is a notable art gallery in the Dvorac Petrovića (Petrović Castle) complex in Podgorica's largest public park. King Nicholas's castle, Perjanički Dom (House of the Honour Guard), castle chapel and surrounding buildings were converted to an art gallery in 1984. Since 1995, it has been part of the Modern Arts Centre (Centar savremenih umjetnosti) and houses approximately 1,500 works of art. The historic Cinema of Culture (Kino Kultura), which was founded in 1949, was closed in November 2008 due to continuous financial losses it generated. It was the only cinema in the city for 6 decades. The building of the former cinema will be converted to host the Podgorica City Theatre. Shortly after its closure, a Ster-Kinekor (later acquired by Cineplexx) 6-screen multiplex cinema opened at Delta City shopping mall. A significant cultural institution of over fifty years' standing is the Budo Tomović Cultural-Informational Centre (KIC Budo Tomović). It is a public institution which organizes various artistic events, including Podgorica Cultural Summer (Podgoričko Kulturno Ljeto), FIAT – International Alternative Theatre Festival (Festival Internacionalnog Alternativnog Teatra), DEUS – December Arts Scene (Decembarska Umjetnička Scena). KIC Budo Tomović was a host for such names as Tony Parsons or Brooklyn Funk Essentials during their visits to Podgorica."
        }
      ],
      "photoLinks": [
        {
          "id": 0,
          "title": "Podgorica view",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Titograd.jpg/320px-Titograd.jpg"
        },
        {
          "id": 1,
          "title": "Cathedral of the Resurrection of Christ",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Cathedral_of_the_Resurrection_of_Christ_%28Podgorica%29%2C_at_night.jpg/320px-Cathedral_of_the_Resurrection_of_Christ_%28Podgorica%29%2C_at_night.jpg"
        },
        {
          "id": 2,
          "title": "Moracka River Canions",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Mora%C4%8Da_River_in_Podgorica.jpg/320px-Mora%C4%8Da_River_in_Podgorica.jpg"
        },
        {
          "id": 3,
          "title": "Indipendence Square",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Podgorica_Trg_Republike.JPG/320px-Podgorica_Trg_Republike.JPG"
        },
        {
          "id": 4,
          "title": "City Seal",
          "link": "https://commons.wikimedia.org/wiki/File:Podgorica_Coat_of_Arms.png#/media/File:Podgorica_Coat_of_Arms.png"
        }
      ]
    },
    {
      "id": 2,
      "cityName": "Sarajevo",
      "latitude": 43.8938759,
      "longtitude": 18.102806,
      "description": [
        {
          "general": "Sarajevo is the capital  and largest city of Bosnia and Herzegovina, with a population of 275,524 in its current administrative limits. The Sarajevo metropolitan area, including Sarajevo Canton and East Sarajevo is home to 688,384 inhabitants. Nestled within the greater Sarajevo valley of Bosnia, it is surrounded by the Dinaric Alps and situated along the Miljacka River in the heart of Southeastern Europe and the Balkans. Sarajevo is the leading political, social and cultural center of Bosnia and Herzegovina, a prominent center of culture in the Balkans, with its region-wide influence in entertainment, media, fashion, and the arts. Due to its long and rich history of religious and cultural variety, Sarajevo was sometimes called the Jerusalem of Europe or Jerusalem of the Balkans.  It is the only major European city to have a mosque, Catholic church, Orthodox church and synagogue within the same neighborhood. A regional center in education, the city is also home to the Balkans' first institution of tertiary education in the form of an Islamic polytechnic called the Saraybosna Osmanlı Medrese, today part of the University of Sarajevo.",
          "history": "One of the earliest findings of settlement in the Sarajevo area is that of the Neolithic Butmir culture. The discoveries at Butmir were made on the grounds of the modern-day Sarajevo suburb Ilidža in 1893 by Austro-Hungarian authorities during the construction of an agricultural school. The area's richness in flint was attractive to Neolithic humans, and the settlement flourished. The settlement developed unique ceramics and pottery designs, which characterize the Butmir people as a unique culture, as described at the International Congress of Archaeologists and Anthropologists meeting in Sarajevo in 1894. The next prominent culture in Sarajevo were the Illyrians. The ancient people, who considered most of the West Balkans as their homeland, had several key settlements in the region, mostly around the river Miljacka and the Sarajevo valley. The Illyrians in the Sarajevo region belonged to the Daesitiates, the last Illyrian people in Bosnia and Herzegovina to resist Roman occupation. Their defeat by the Roman emperor Tiberius in 9 A.D. marks the start of Roman rule in the region. The Romans never built up the region of modern-day Bosnia, but the Roman colony of Aquae Sulphurae was located near the top of present-day Ilidža, and was the most important settlement of the time.After the Romans, the Goths settled the area, followed by the Slavs in the 7th century.During the Middle Ages Sarajevo was part of the Bosnian province of Vrhbosna near the traditional center of the Kingdom of Bosnia. Though a city named Vrhbosna existed, the exact settlement in Sarajevo at this time is debated. Various documents note a place called Tornik in the region, most likely in the area of Marijin Dvor neighborhood. By all indications, Tornik was a very small marketplace surrounded by a proportionally small village, and was not considered very important by Ragusan merchants. ",
          "geography": "Sarajevo is located near the geometric center of the triangular-shaped Bosnia-Herzegovina and within the historical region of Bosnia proper. It is situated 518 meters (1,699 ft) above sea level and lies in the Sarajevo valley, in the middle of the Dinaric Alps. The valley itself once formed a vast expanse of greenery, but gave way to urban expansion and development in the post-World War II era. The city is surrounded by heavily forested hills and five major mountains. The highest of the surrounding peaks is Treskavica at 2,088 meters (6,850 ft), then Bjelašnica mountain at 2,067 meters (6,781 ft), Jahorina at 1,913 meters (6,276 ft), Trebević at 1,627 meters (5,338 ft), with 1,502 meters (4,928 ft) Igman being the shortest. The last four are also known as the Olympic Mountains of Sarajevo (see also 1984 Winter Olympics). The city itself has its fair share of hilly terrain, as evidenced by the many steeply inclined streets and residences seemingly perched on the hillsides. The Miljacka river is one of the city's chief geographic features. It flows through the city from east through the center of Sarajevo to west part of city where eventually meets up with the Bosna river. Miljacka river is The Sarajevo River, with its source (Vrelo Miljacke) 2 kilometres (1.2 miles) south of the town of Pale at the foothills of Mount Jahorina, several kilometers to the east of Sarajevo center. The Bosna's source, Vrelo Bosne near Ilidža (west Sarajevo), is another notable natural landmark and a popular destination for Sarajevans and other tourists. Several smaller rivers and streams such as Koševski Potok also run through the city and its vicinity.",
          "climate": "Sarajevo has a humid continental climate. Sarajevo's climate exhibits influences of oceanic zones, with four seasons and uniformly spread precipitation. The proximity of the Adriatic Sea moderates Sarajevo's climate somewhat, although the mountains to the south of the city greatly reduce this maritime influence.[28] The average yearly temperature is 10 °C (50 °F), with January (−0.5 °C (31.1 °F) avg.) being the coldest month of the year and July (19.7 °C (67.5 °F) avg.) the warmest.",
          "culture": "Sarajevo has been home to many different religions for centuries, giving the city a range of diverse cultures. In the time of Ottoman occupation of Bosnia, Muslims, Serbian Orthodox, Roman Catholics, and Sephardi Jews all shared the city while maintaining distinctive identities. They were joined during the brief occupation by Austria-Hungary by a smaller number of Germans, Hungarians, Slovaks, Czechs and Ashkenazi Jews. By 1909, about 50% of the city's inhabitants were Muslim, 25% were Catholic, 15% were Orthodox, and 10% were Jewish. Historically, Sarajevo has been home to several famous Bosnian poets, scholars, philosophers, and writers during the Ottoman Empire. To list only a very few; Nobel Prize-winner Vladimir Prelog is from the city, as is Academy Award-winning director Danis Tanović, multiple award-winning writer Aleksander Hemon and famous multiple award-winning writer and screenwriter Zlatko Topčić. One of the region's most prolific and prominent poets, writers and screenwriters, Abdulah Sidran is also a Sarajevo native. Nobel Prize-winner Ivo Andrić attended high school in Sarajevo for two years. Sarajevo is also the home of the East West Theatre Company, the only independent theater company in Bosnia and Herzegovina. The Sarajevo National Theatre is the oldest professional theater in Bosnia and Herzegovina, having been established in 1921."
        }
      ],
      "photoLinks": [
        {
          "id": 0,
          "title": "Sarajevo from above",
          "link": "http://3.bp.blogspot.com/-rBYLQk_t1Qg/VSveH9yFG2I/AAAAAAAAAcY/TmLKYKe6ZN8/s1600/1506593_960568220621088_3552735560717452342_n.jpg"
        },
        {
          "id": 1,
          "title": "Sarajevo River Miljacka",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Sarajevo_Miljacka.JPG/252px-Sarajevo_Miljacka.JPG"
        },
        {
          "id": 2,
          "title": "Vrelo Bosne park in the city outskirt",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Bridge_on_Vrelo_Bosne.jpg/320px-Bridge_on_Vrelo_Bosne.jpg"
        },
        {
          "id": 3,
          "title": "Sarajevo Then and Now",
          "link": "http://www.trbimg.com/img-56f41ce7/turbine/la-fg-bosnian-war-sarajevo-then-and-now-slider-20160324"
        },
        {
          "id": 4,
          "title": "City Seal",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Coat_of_arms_of_Sarajevo.svg/186px-Coat_of_arms_of_Sarajevo.svg.png"
        }
      ]
    },
    {
      "id": 3,
      "cityName": "Budapest",
      "latitude": 47.4807765,
      "longtitude": 18.569875,
      "description": [
        {
          "general": "Budapest  is the capital and most populous city of Hungary, one of the largest cities in the European Union.  It has an area of 525 square kilometres (203 square miles) and a population of about 1.8 million within the administrative limits in 2016. It is both a city and county, and forms the centre of the Budapest Metropolitan Area, which has an area of 7,626 square kilometres (2,944 square miles) and a population of 3.3 million, comprising 33 percent of the population of Hungary.[14][15] Budapest became a single city occupying both banks of the Danube river with the unification of Buda and Óbuda on the west bank, with Pest on the east bank on November 17, 1873.",
          "history": "The first settlement on the territory of Budapest was built by Celts before 1 AD. It was later occupied by the Romans. The Roman settlement – Aquincum – became the main city of Pannonia Inferior in 106 AD.  At first it was a military settlement, and gradually the city rose around it, making it the focal point of the city's commercial life. Today this area corresponds to the Óbuda district within Budapest. The Romans constructed roads, amphitheaters, baths and houses with heated floors in this fortified military camp. The Roman city of Aquincum is the best-conserved of the Roman sites in Hungary. The archaeological site was turned into a museum with inside and open-air sections. The Magyar tribes led by Árpád, forced out of their original homeland north of Bulgaria by Tsar Simeon after the Battle of Southern Buh, settled in the territory at the end of the 9th century displacing the founding Bulgarian settlers of the towns of Buda and Pest, and a century later officially founded the Kingdom of Hungary. Research places the probable residence of the Árpáds as an early place of central power near what became Budapest. The Tatar invasion in the 13th century quickly proved that it is difficult to mount a defence on a plain.  King Béla IV of Hungary therefore ordered the construction of reinforced stone walls around the towns and set his own royal palace on the top of the protecting hills of Buda. In 1361 it became the capital of Hungary. The cultural role of Buda was particularly significant during the reign of King Matthias Corvinus. The Italian Renaissance had a great influence on the city. His library, the Bibliotheca Corviniana, was Europe's greatest collection of historical chronicles and philosophic and scientific works in the 15th century, and second only in size to the Vatican Library.  After the foundation of the first Hungarian university in Pécs in 1367 (University of Pécs), the second one was established in Óbuda in 1395 (University of Óbuda). The first Hungarian book was printed in Buda in 1473. Buda had about 5,000 inhabitants around 1500.",
          "geography": "Budapest, strategically placed at the centre of the Carpathian Basin, lies on an ancient route linking the hills of Transdanubia with the Great Plain. By road it is 216 kilometres (134 mi) south-east of Vienna, 545 kilometres (339 mi) south of Warsaw, 1,565 kilometres (972 mi) south-west of Moscow, 1,122 kilometres (697 mi) north of Athens, 788 kilometres (490 mi) north-east of Milan, and 443 kilometres (275 mi) south-east of Prague. The 525 square kilometres (203 sq mi) area of Budapest lies in Central Hungary, surrounded by settlements of the agglomeration in Pest county. The capital extends 25 and 29 km (16 and 18 mi) in the north-south, east-west direction respectively. The Danube enters the city from the north; later it encircles two islands, Óbuda Island and Margaret Island.[13] The third island Csepel Island is the largest of the Budapest Danube islands, however only its northernmost tip is within city limits. The river that separates the two parts of the city is 230 m (755 ft) wide at its narrowest point in Budapest. Pest lies on the flat terrain of the Great Plain while Buda is rather hilly. The city's importance in terms of traffic is very central, because all major European roads and European railway lines lead to Budapest.  The Danube was and is still an important water-way and this region in the centre of the Carpathian Basin lies at the cross-roads of trade routes. Budapest is one of only two capital cities in the world which has thermal springs (the other being Reykjavík in Iceland). Some 125 springs produce 70 million litres (15,000,000 imperial gallons; 18,000,000 US gallons) of thermal water a day, with temperatures ranging up to 58 Celsius. Some of these waters have medicinal effects due to their medically valuable mineral contents.",
          "climate": "Budapest has a humid continental climate (Köppen Dfb/Cfb) that closely borders a cold semi-arid climate (BSk), with relatively cold winters and warm summers.[80] Winter (November until early March) can be cold and the city receives little sunshine. Snowfall is fairly frequent in most years, and nighttime temperatures of −10 °C (14 °F) are not uncommon between mid-December and mid-February. The spring months (March and April) see variable conditions, with a rapid increase in the average temperature. The weather in late March and April is often very agreeable during the day and fresh at night. Budapest's long summer – lasting from May until mid-September – is warm or very warm. Budapest has as much summer sunshine as many Mediterranean resorts. Sudden heavy showers also occur, particularly in May and June. The autumn in Budapest (mid-September until late October) is characterised by little rain and long sunny days with moderate temperatures. Temperatures often turn abruptly colder in late October. ",
          "culture": "The culture of Budapest is reflected by Budapest's size and variety. Most Hungarian cultural movements first emerged in the city. Budapest is an important center for music, film, theatre, dance and visual art. Artists have been drawn into the city by opportunity, as the city government funds the arts with adequate financial resources. Budapest is the headquarters of the Hungarian LGBT community. Budapest is packed with museums and galleries, and there are plenty of temporary exhibitions in the most unlikely of settings, particularly in summer. The city glories in 223 museums and galleries, which presents several memories, not only the Hungarian historical, art and science ones, but also the memories of universal and European culture and science. Here are the greatest examples among them: the Hungarian National Museum, the Hungarian National Gallery, the Museum of Fine Arts (where can see the pictures of Hungarian painters, like Victor Vasarely, Mihály Munkácsy and a great collection about Italian art, Dutch art, Spanish art and British art from before the 19th century and French art, British art, German art, Austrian art after the 19th century), the House of Terror, the Budapest Historical Museum, the Aquincum Museum, the Memento Park, Museum of Applied Arts and the contemporary arts exhibition Palace of Arts Budapest.[191] In Budapest there are currently 837 different monuments, which represent the most of the European artistic style. The classical and unique Hungarian Art Nouveau buildings are prominent. In Budapest there are forty theatres, seven concert halls and an opera house. Outdoor festivals, concerts and lectures enrich the cultural offer of summer, which are often held in historical buildings. The largest theatre facilities are the Budapest Operetta and Musical Theatre, the József Attila Theatre, the Katona József Theatre, the Madách Theatre, the Hungarian State Opera House, the National Theatre, the Vigadó Concert Hall, Radnóti Miklós Theatre, the Comedy Theatre and the Palace of Arts, known as MUPA. The Budapest Opera Ball is an annual Hungarian society event taking place in the building of the Budapest Opera (Operaház) on the last Saturday of the carnival season, usually late February."
        }
      ],
      "photoLinks": [
        {
          "id": 0,
          "title": "Budapest from above",
          "link": "https://thumbs.dreamstime.com/x/budapest-above-city-life-danube-promenade-river-cruise-ships-harbour-31775309.jpg"
        },
        {
          "id": 1,
          "title": "View from Danub",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Sz%C3%A9chenyi_Chain_Bridge_in_Budapest_at_night.jpg/320px-Sz%C3%A9chenyi_Chain_Bridge_in_Budapest_at_night.jpg"
        },
        {
          "id": 2,
          "title": "Budapest Parliament",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Parliament_Building%2C_Budapest%2C_outside.jpg/320px-Parliament_Building%2C_Budapest%2C_outside.jpg"
        },
        {
          "id": 3,
          "title": "Budapest Then and Now",
          "link": "http://hungarytoday.hu/wp-content/uploads/2015/10/48fa4fa2c582355d222c8815143e65ea-749x415.jpg"
        },
        {
          "id": 4,
          "title": "City Seal",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Coa_Hungary_Town_Budapest_big.svg/298px-Coa_Hungary_Town_Budapest_big.svg.png"
        }
      ]
    },
    {
      "id": 4,
      "cityName": "Vienna",
      "latitude": 48.2202383,
      "longtitude": 15.8196338,
      "description": [
        {
          "general": "Vienna  is the capital and largest city of Austria and one of the nine states of Austria. Vienna is Austria's primary city, with a population of about 1.8 million  (2.6 million within the metropolitan area,  nearly one third of Austria's population), and its cultural, economic, and political centre. It is the 7th-largest city by population within city limits in the European Union. Until the beginning of the 20th century, it was the largest German-speaking city in the world, and before the splitting of the Austro-Hungarian Empire in World War I, the city had 2 million inhabitants. Vienna is host to many major international organizations, including the United Nations and OPEC. The city is located in the eastern part of Austria and is close to the borders of the Czech Republic, Slovakia, and Hungary. These regions work together in a European Centrope border region. Along with nearby Bratislava, Vienna forms a metropolitan region with 3 million inhabitants. In 2001, the city centre was designated a UNESCO World Heritage Site. Apart from being regarded as the City of Music  because of its musical legacy, Vienna is also said to be The City of Dream because it was home to the world's first psycho-analyst – Sigmund Freud.",
          "history": "Evidence has been found of continuous habitation since 500 BC, when the site of Vienna on the Danube River was settled by the Celts. In 15 BC, the Romans fortified the frontier city they called Vindobona to guard the empire against Germanic tribes to the north. One of the earliest references to Vienna is from the Jewish historian, Josephus, who recounts that the king of Judea, Herod Archelaus (ca. 23 BCE – 18 CE) was banished to the city of Vienna in Gaul by Caesar. Close ties with other Celtic peoples continued through the ages. The Irish monk Saint Colman (or Koloman, Irish Colmán, derived from colm dove) is buried in Melk Abbey and Saint Fergil (Virgil the Geometer) was Bishop of Salzburg for forty years, and twelfth-century monastic settlements were founded by Irish Benedictines. Evidence of these ties is still evident in Vienna's great Schottenstift monastery, once home to many Irish monks. In 976, Leopold I of Babenberg became count of the Eastern March, a 60-mile district centering on the Danube on the eastern frontier of Bavaria. This initial district grew into the duchy of Austria. Each succeeding Babenberg ruler expanded the march east along the Danube eventually encompassing Vienna and the lands immediately east. In 1145, Duke Henry II Jasomirgott moved the Babenberg family residence from Klosterneuburg to Vienna. Since that time, Vienna remained the center of the Babenberg dynasty. In 1440, Vienna became the resident city of the Habsburg dynasty. It eventually grew to become the de facto capital of the Holy Roman Empire (1483–1806) and a cultural centre for arts and science, music and fine cuisine. Hungary occupied the city between 1485–1490. In the 16th and 17th centuries, the Ottoman armies were stopped twice outside Vienna (see Siege of Vienna, 1529 and Battle of Vienna, 1683). A plague epidemic ravaged Vienna in 1679, killing nearly a third of its population.",
          "geography": "Vienna is located in northeastern Austria, at the easternmost extension of the Alps in the Vienna Basin. The earliest settlement, at the location of today's inner city, was south of the meandering Danube while the city now spans both sides of the river. Elevation ranges from 151 to 542 m (495 to 1,778 ft). The city has a total area of 414.65 square kilometres (160.1 sq mi), making it the largest city in Austria by area.",
          "climate": "Vienna lies within a transition of oceanic climate and humid subtropical climate (hovering just below 22 °C in July and August), and features, according to the Köppen classification, a Cfb (oceanic) -climate. The city has warm summers with average high temperatures of 24 to 33 °C (75 to 91 °F), with maximum exceeding 38 °C (100 °F) and lows of around 17 °C (63 °F). Winters are relatively dry and cold with average temperatures at about freezing point. Spring and autumn are mild. Precipitation is generally moderate throughout the year, averaging 550 mm (21.7 in) annually, with considerable local variations, the Vienna Woods region in the west being the wettest part (700 to 800 mm (28 to 31 in) annually) and the flat plains in the east being the driest part (500 to 550 mm (20 to 22 in) annually). Snow in the winter is not uncommon, but rare compared to Western and Southern regions in Austria.",
          "culture": "Musical luminaries including Wolfgang Amadeus Mozart, Joseph Haydn, Ludwig van Beethoven, Ferdinand Ries, Franz Schubert, Johannes Brahms, Gustav Mahler, Robert Stolz, and Arnold Schoenberg have worked there. Art and culture had a long tradition in Vienna, including theatre, opera, classical music and fine arts. The Burgtheater is considered one of the best theatres in the German-speaking world alongside its branch, the Akademietheater. The Volkstheater Wien and the Theater in der Josefstadt also enjoy good reputations. There is also a multitude of smaller theatres, in many cases devoted to less mainstream forms of the performing arts, such as modern, experimental plays or cabaret. Vienna is also home to a number of opera houses, including the Theater an der Wien, the Staatsoper and the Volksoper, the latter being devoted to the typical Viennese operetta. Classical concerts are performed at world-famous venues such as the Wiener Musikverein, home of the Vienna Philharmonic Orchestra known across the world for the annual widely broadcast New Year's Day Concert, as well as the Wiener Konzerthaus, home of the internationally renowned Vienna Symphony. Many concert venues offer concerts aimed at tourists, featuring popular highlights of Viennese music, particularly the works of Wolfgang Amadeus Mozart, Johann Strauss I, and Johann Strauss II. Up until 2005, the Theater an der Wien has hosted premieres of musicals, although with the year of the Mozart celebrations 2006 it has devoted itself to the opera again and has since become a stagione opera house offering one new production each month, thus quickly becoming one of Europe's most interesting and advanced opera houses. Since 2012 Theater an der Wien has taken over the Wiener Kammeroper, a historical small theatre in the first district of Vienna seating 300 spectators, turning it into its second venue for smaller sized productions and chamber operas created by the young ensemble of Theater an der Wien (JET). Before 2005 the most successful musical was Elisabeth, which was later translated into several languages and performed all over the world. The Wiener Taschenoper is dedicated to stage music of the 20th and 21st century. The Haus der Musik (house of music) opened in the year 2000. The Wienerlied is a unique song genre from Vienna. There are approximately 60,000 – 70,000 Wienerlieder. The Hofburg is the location of the Imperial Treasury (Schatzkammer), holding the imperial jewels of the Habsburg dynasty. The Sisi Museum (a museum devoted to Empress Elisabeth of Austria) allows visitors to view the imperial apartments as well as the silver cabinet. Directly opposite the Hofburg are the Kunsthistorisches Museum, which houses many paintings by old masters, ancient and classical artifacts, and the Naturhistorisches Museum. A number of museums are located in the Museumsquartier (museum quarter), the former Imperial Stalls which were converted into a museum complex in the 1990s. It houses the Museum of Modern Art, commonly known as the MUMOK (Ludwig Foundation), the Leopold Museum (featuring the largest collection of paintings in the world by Egon Schiele, as well as works by the Vienna Secession, Viennese Modernism and Austrian Expressionism), the AzW (museum of architecture), additional halls with feature exhibitions, and the Tanzquartier. The Liechtenstein Palace contains much of one of the world's largest private art collections, especially strong in the Baroque. Castle Belvedere, built under Prinz Eugen, has a gallery containing paintings by Gustav Klimt (The Kiss), Egon Schiele, and other painters of the early 20th century, also sculptures by Franz Xaver Messerschmidt, and changing exhibitions too. There are a multitude of other museums in Vienna, including the Albertina, the Military History Museum, the Technical Museum, the Burial Museum, the Museum of Art Fakes, the KunstHausWien, Museum of Applied Arts, the Sigmund Freud Museum, and the Mozarthaus Vienna. The museums on the history of the city, including the former Historical Museum of the City of Vienna on Karlsplatz, the Hermesvilla, the residences and birthplaces of various composers, the Museum of the Romans, and the Vienna Clock Museum, are now gathered together under the group umbrella Vienna Museum. In addition there are museums dedicated to Vienna's individual districts. They provide a record of individual struggles, achievements and tragedy as the city grew and survived two world wars. For readers seeking family histories these are good sources of information."
        }
      ],
      "photoLinks": [
        {
          "id": 0,
          "title": "Vienna City Hall",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Wien_Rathaus_hochaufl%C3%B6send.jpg/320px-Wien_Rathaus_hochaufl%C3%B6send.jpg"
        },
        {
          "id": 1,
          "title": "Vienna View",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/13-08-30-wien-by-RalfR-123.jpg/320px-13-08-30-wien-by-RalfR-123.jpg"
        },
        {
          "id": 2,
          "title": "Vienna Then and Now Combination",
          "link": "http://iliketowastemytime.com/sites/default/files/sergey_larenkov_war_before_and_now5.jpg"
        },
        {
          "id": 3,
          "title": "St. Stephans Cathedral",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/St._Stephens_Cathedral_%28Stephansdom%29_%287815703256%29.jpg/320px-St._Stephens_Cathedral_%28Stephansdom%29_%287815703256%29.jpg"
        },
        {
          "id": 4,
          "title": "City Seal",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Vienna_seal_1926.svg/239px-Vienna_seal_1926.svg.png"
        }
      ]
    },
    {
      "id": 5,
      "cityName": "Munich",
      "latitude": 48.1550284,
      "longtitude": 11.2616528,
      "description": [
        {
          "general": "Munich is the capital and largest city of the German state of Bavaria, on the banks of River Isar north of the Bavarian Alps. Munich is the third largest city in Germany, after Berlin and Hamburg, and the 12th biggest city of the European Union, with a population of around 1.5 million. The Munich Metropolitan Region is home to 6 million people. The city is a major centre of art, advanced technologies, finance, publishing, culture, innovation, education, business, and tourism in Germany and Europe and enjoys a very high standard and quality of living, reaching #1 in Germany and #4 worldwide according to the 2015 Mercer survey. According to the Globalization and World Rankings Research Institute Munich is considered an alpha-world city, as of 2015. ",
          "history": "The year 1158 is assumed to be the foundation date, which is the earliest date the city is mentioned in a document. The document was signed in Augsburg. By that time the Guelph Henry the Lion, Duke of Saxony and Bavaria, had built a bridge over the river Isar next to a settlement of Benedictine monks—this was on the Old Salt Route and a toll bridge. In 1175, Munich was officially granted city status and received fortification. In 1180, with the trial of Henry the Lion, Otto I Wittelsbach became Duke of Bavaria and Munich was handed over to the Bishop of Freising. (Wittelsbach's heirs, the Wittelsbach dynasty, would rule Bavaria until 1918.) In 1240, Munich was transferred to Otto II Wittelsbach and in 1255, when the Duchy of Bavaria was split in two, Munich became the ducal residence of Upper Bavaria. Duke Louis IV, a native of Munich, was elected German king in 1314 and crowned as Holy Roman Emperor in 1328. He strengthened the city's position by granting it the salt monopoly, thus assuring it of additional income. In the late 15th century Munich underwent a revival of gothic arts—the Old Town Hall was enlarged, and Munich's largest gothic church, now a cathedral—the Frauenkirche—constructed in only twenty years, starting in 1468. When Bavaria was reunited in 1506, Munich became its capital. The arts and politics became increasingly influenced by the court (see Orlando di Lasso, Heinrich Schütz and later Mozart and Richard Wagner). During the 16th century Munich was a centre of the German counter reformation, and also of renaissance arts. Duke Wilhelm V commissioned the Jesuit Michaelskirche, which became a centre for the counter-reformation, and also built the Hofbräuhaus for brewing brown beer in 1589. Following the outbreak of World War I in 1914, life in Munich became very difficult, as the Allied blockade of Germany led to food and fuel shortages. During French air raids in 1916, three bombs fell on Munich. After World War I, the city was at the centre of much political unrest. In November 1918 on the eve of revolution, Ludwig III and his family fled the city. After the murder of the first republican premier of Bavaria Kurt Eisner in February 1919 by Anton Graf von Arco auf Valley, the Bavarian Soviet Republic was proclaimed. When Communists had taken power, Lenin, who had lived in Munich some years before, sent a congratulatory telegram, but the Soviet Republic was put down on 3 May 1919 by the Freikorps. While the republican government had been restored, Munich subsequently became a hotbed of extremist politics, among which Adolf Hitler and the National Socialists rose to prominence. The city is known as the site of the culmination of the policy of appeasement employed by Britain and France leading up to World War II. It was in Munich that British Prime Minister Neville Chamberlain assented to the annexation of Czechoslovakia's Sudetenland region into Greater Germany in the hopes of sating the desires of Hitler's Third Reich. Munich was the base of the White Rose, a student resistance movement from June 1942 to February 1943. The core members were arrested and executed following a distribution of leaflets in Munich University by Hans and Sophie Scholl. The city was heavily damaged by allied bombing during World War II—the city was hit by 71 air raids over a period of five years. ",
          "geography": "Munich lies on the elevated plains of Upper Bavaria, about 50 km (31.07 mi) north of the northern edge of the Alps, at an altitude of about 520 m (1,706.04 ft) ASL. The local rivers are the Isar and the Würm. Munich is situated in the Northern Alpine Foreland. The northern part of this sandy plateau includes a highly fertile flint area which is no longer affected by the folding processes found in the Alps, while the southern part is covered with morainic hills. Between these are fields of fluvio-glacial out-wash, such as around Munich. Wherever these deposits get thinner, the ground water can permeate the gravel surface and flood the area, leading to marshes as in the north of Munich.",
          "climate": "Munich's city climate lies between the humid continental climate (Köppen classification: Dfb) and the oceanic climate (Köppen classification: Cfb). The city centre lies between both climates, while the airport of Munich has a humid continental climate. The warmest month of the year, on average, is July. The coolest month of the year, on average, is January. The higher elevation of Munich and the proximity of the Alps play a significant role on the climate, causing the city to have more rain and snow than many other parts of Germany. The Alps affect the city's climate in other ways too: the warm downhill wind from the Alps (föhn wind), which can raise temperatures sharply within a few hours even in the winter is but one example. Being at the centre of Europe, Munich is subject to many climatic influences, so that weather conditions there are more variable than in other European cities, especially those further west and south of the Alps.",
          "culture": "The Austro-Bavarian language is spoken in and around Munich, with its variety Upper Bavarian (Oberbayrisch). Austro-Bavarian has no official status by the Bavarian authorities or local government yet is recognised by the SIL and has its own ISO-639 code. Deutsches Museum or German Museum, located on an island in the River Isar, is the largest and one of the oldest science museums in the world. Three redundant exhibition buildings which are under a protection order were converted to house the Verkehrsmuseum, which houses the land transport collections of the Deutsches Museum. Deutsches Museum's Flugwerft Schleissheim flight exhibition centre is located nearby, on the Schleissheim Special Landing Field.Several non-centralised museums (many of those are public collections at Ludwig-Maximilians-Universität) show the expanded state collections of palaeontology, geology, mineralogy, zoology, botany and anthropology. The city has several important art galleries, most of which can be found in the Kunstareal, including the Alte Pinakothek, the Neue Pinakothek, the Pinakothek der Moderne and the Museum Brandhorst. Alte Pinakothek's monolithic structure contains a treasure trove of the works of European masters between the 14th and 18th centuries. The collection reflects the eclectic tastes of the Wittelsbachs over four centuries, and is sorted by schools over two sprawling floors. Major displays include Albrecht Dürer's Christ-like Self-Portrait, his Four Apostles, Raphael's paintings The Canigiani Holy Family and Madonna Tempi as well as Peter Paul Rubens two-story-high Judgment Day. The gallery houses one of the world's most comprehensive Rubens collections. Before World War I, the Blaue Reiter group of artists worked in Munich. Many of their works can now be seen at the Lenbachhaus. An important collection of Greek and Roman art is held in the Glyptothek and the Staatliche Antikensammlung (State Antiquities Collection). King Ludwig I managed to acquire such famous pieces as the Medusa Rondanini, the Barberini Faun and figures from the Temple of Aphaea on Aegina for the Glyptothek. Another important museum in the Kunstareal is the Egyptian Museum. Another area for the arts next to the Kunstareal is the Lehel quarter between the old town and the river Isar: The Museum Five Continents in Maximilianstraße is the second largest collection in Germany of artefacts and objects from outside Europe, while the Bavarian National Museum and the adjoining Bavarian State Archaeological Collection in Prinzregentenstrasse rank among Europe's major art and cultural history museums. The nearby Schackgalerie is an important gallery of German 19th-century paintings. Munich is a major European cultural centre and has played host to many prominent composers including Orlando di Lasso, W.A. Mozart, Carl Maria von Weber, Richard Wagner, Gustav Mahler, Richard Strauss, Max Reger and Carl Orff. With the Munich Biennale founded by Hans Werner Henze, and the A*DEvantgarde festival, the city still contributes to modern music theatre. Some of classical music's best-known pieces have been created in and around Munich by native composers, for example Richard Strauss's famous tone poem Also sprach Zarathustra or Carl Orff's Carmina Burana. Hofbräuhaus am Platzl, arguably the most famous beer hall worldwide, is located in the city centre. It also operates the second largest tent at the Oktoberfest, one of Munich's most famous attractions. For two weeks, the Oktoberfest attracts millions of people visiting its beer tents (Bierzelte) and fairground attractions. The Oktoberfest was first held on 12 October 1810 in honour of the marriage of crown prince Ludwig to Princess Therese of Saxe-Hildburghausen. The festivities were closed with a horse race and in the following years the horse races were continued and later developed into what is now known as the Oktoberfest. Despite its name, most of Oktoberfest occurs in September. It always finishes on the first Sunday in October unless the German national holiday on 3 October (Tag der deutschen Einheit, i. e., Day of German Unity) is a Monday or Tuesday—then the Oktoberfest remains open for these days."
        }
      ],
      "photoLinks": [
        {
          "id": 0,
          "title": "Munchen National Museum",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Bayerisches_Nationalmuseum_-_Muenchen_-_2013.jpg/320px-Bayerisches_Nationalmuseum_-_Muenchen_-_2013.jpg"
        },
        {
          "id": 1,
          "title": "Munchen",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Ludwigstra%C3%9FeMUC.jpg/320px-Ludwigstra%C3%9FeMUC.jpg"
        },
        {
          "id": 2,
          "title": "Old Town of Munchen",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Stadtbild_M%C3%BCnchen.jpg/320px-Stadtbild_M%C3%BCnchen.jpg"
        },
        {
          "id": 3,
          "title": "Munchen Then and Now",
          "link": "http://data.whicdn.com/images/806029/large.jpg"
        },
        {
          "id": 4,
          "title": "City Seal",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Muenchen_Kleines_Stadtwappen.svg/215px-Muenchen_Kleines_Stadtwappen.svg.png"
        }
      ]
    },
    {
      "id": 6,
      "cityName": "Frankfurt",
      "latitude": 50.1213152,
      "longtitude": 8.3563799,
      "description": [
        {
          "general": "Frankfurt am Main is a metropolis and the largest city in the German state of Hesse and the fifth-largest city in Germany, with a 2015 population of 731,095 within its administrative boundaries,  and 2.3 million in its urban area. The city is at the centre of the larger Frankfurt Rhine-Main Metropolitan Region, which has a population of 5.8 million and is Germany's second-largest metropolitan region after Rhine-Ruhr. Since the enlargement of the European Union in 2013, the geographic centre of the EU is about 40 km (25 mi) to the east of Frankfurt's CBD, the Bankenviertel. Frankfurt is culturally and ethnically diverse, with around half of the population, and a majority of young people, having a migration background. A quarter of the population are foreign nationals, including many expatriates. Frankfurt is an alpha world city and a global hub for commerce, culture, education, tourism and transportation. It's the site of many global and European corporate headquarters. Frankfurt Airport is among the world's busiest. Frankfurt is the major financial centre of the European continent, with the HQs of the European Central Bank, German Federal Bank, Frankfurt Stock Exchange, Deutsche Bank, Commerzbank, DZ Bank, KfW, several cloud and fintech startups and other institutes. Automotive, technology and research, services, consulting, media and creative industries complement the economic base. Frankfurt's DE-CIX is the world's largest internet exchange point. Messe Frankfurt is one of the world's largest trade fairs. Major fairs include the Frankfurt Motor Show, the world's largest motor show, the Music Fair, and the Frankfurt Book Fair, the world's largest book fair. ",
          "history": "Roman settlements were established in the area of the Römer, probably in the first century. Nida (Heddernheim) was also a Roman civitas capital. Alemanni and Franks lived there, and by 794, Charlemagne presided over an imperial assembly and church synod, at which Franconofurd (alternative spellings end with -furt and -vurd) was first mentioned. Frankfurt was one of the most important cities in the Holy Roman Empire. From 855, the German kings and emperors were elected and crowned in Aachen. From 1562, the kings and emperors were crowned in Frankfurt, initiated for Maximilian II. This tradition ended in 1792, when Franz II was elected. His coronation was deliberately held on Bastille Day, 14 July, the anniversary of the storming of the Bastille. The elections and coronations took place in St. Bartholomäus Cathedral, known as the Kaiserdom (Emperor's Cathedral), or its predecessors. The Frankfurter Messe (Frankfurt Trade Fair) was first mentioned in 1150. In 1240, Emperor Friedrich II granted an imperial privilege to its visitors, meaning they would be protected by the empire. The fair became particularly important when similar fairs in French Beaucaire lost attraction around 1380. Book trade fairs began in 1478. In 1372, Frankfurt became a Reichsstadt (Imperial Free City), i.e., directly subordinate to the Holy Roman Emperor and not to a regional ruler or a local nobleman. In 1585, Frankfurt traders established a system of exchange rates for the various currencies that were circulating to prevent cheating and extortion. Therein lay the early roots for the Frankfurt Stock Exchange. Frankfurt managed to remain neutral during the Thirty Years' War, but suffered from the bubonic plague that refugees brought to the city. After the war, Frankfurt regained its wealth. After the ill-fated revolution of 1848, Frankfurt was the seat of the first democratically elected German parliament, the Frankfurt Parliament, which met in the Frankfurter Paulskirche (St. Paul's Church) and was opened on 18 May 1848. The institution failed in 1849 when the Prussian king declared that he would not accept a crown from the gutter. In the year of its existence, the assembly developed a common constitution for a unified Germany, with the Prussian king as its monarch. Frankfurt lost its independence after the Austro-Prussian War in 1866 when Prussia annexed several smaller states, among them the Free City of Frankfurt. Frankfurt had stayed neutral in the war, but its free press bothered the Prussians and they used the opportunity to occupy the city by force: Bismarck had been an ambassador to the German Confederation there and constantly quarrelled with the local press. The Prussian administration incorporated Frankfurt into its province of Hesse-Nassau. The formerly independent towns of Bornheim and Bockenheim were incorporated in 1890. In 1914, the citizens founded the University of Frankfurt, later named Goethe University Frankfurt. This marked the only civic foundation of a university in Germany; today it is one of Germany's largest. Frankfurt was severely bombed in World War II (1939–1945). About 5,500 residents were killed during the raids, and the once-famous medieval city centre, by that time the largest in Germany, was almost completely destroyed. It became a ground battlefield on 26 March 1945, when the Allied advance into Germany was forced to take the city in contested urban combat that included a river assault. The 5th Infantry Division and the 6th Armored Division of the United States Army captured Frankfurt after several days of intense fighting, and it was declared largely secure on 29 March 1945. After the end of the war, Frankfurt became a part of the newly founded state of Hesse, consisting of the old Hesse-(Darmstadt) and the Prussian Hesse provinces. The city was part of the American Zone of Occupation of Germany. The Military Governor for the United States Zone (1945–1949) and the United States High Commissioner for Germany (HICOG) (1949–1952) had their headquarters in the IG Farben Building, intentionally left undamaged by the Allies' wartime bombardment. Frankfurt was the original choice for the provisional capital city of the newly founded state of West Germany in 1949. The city constructed a parliament building that was never used for its intended purpose (it housed the radio studios of Hessischer Rundfunk). In the end, Konrad Adenauer, the first postwar Chancellor, preferred the town of Bonn, for the most part because it was close to his hometown, but also because many other prominent politicians opposed the choice of Frankfurt out of concern that Frankfurt would be accepted as the permanent capital, thereby weakening the West German population's support for a reunification with East Germany and the eventual return of the capital to Berlin.",
          "geography": "Frankfurt is located on both sides of the Main River, south-east of the Taunus mountain range. The southern part of the city contains the Frankfurt City Forest, Germany's largest city forest. The city area is 248.31 km2 (95.87 sq mi) and extends over 23.4 km (14.54 mi) east to west and 23.3 km (14.48 mi) north to south. The city centre is north of the River Main in Altstadt district (the historical centre) and the surrounding Innenstadt district. The geographical centre is in Bockenheim district near Frankfurt West station. Frankfurt is the centre of the densely populated Frankfurt Rhine-Main Metropolitan Region with a population of 5.5 million. Other important cities in the region are Wiesbaden (capital of Hessen), Mainz (capital of Rhineland-Palatinate), Darmstadt, Offenbach am Main, Hanau, Aschaffenburg, Bad Homburg vor der Höhe, Rüsselsheim, Wetzlar and Marburg.",
          "climate": "Frankfurt has a temperate-oceanic climate (Köppen: Cfb). Its average annual temperature is 10.6 °C (51.1 °F), with monthly mean temperatures ranging from 1.6 °C (34.9 °F) in January to 20.0 °C (68.0 °F) in July.",
          "culture": "With more than 30 museums, Frankfurt has one of the largest variety of museums in Europe. 20 museums are part of the Museumsufer (Museums Riverbank), located on the front row of both sides of the Main riverbank or nearby. Ten museums are located on the southern riverbank in Sachsenhausen between the Eiserner Steg and the Friedensbrücke. The street itself, Schaumainkai, is partially closed to traffic on Saturdays for Frankfurt's largest flea market. Eurodance and Trance music originated in Frankfurt. In 1989 German producers Michael Münzing and Luca Anzilotti (under the pseudonyms Benito Benites and John Virgo Garrett III) formed the Snap! project. Snap! songs combined Rap and Soul vocals adding rhythm by using computer technology and mixing electronic sounds, bass and drums. By doing so a new genre was born: Eurodance.  In the early 1990s, DJs including Sven Väth and DJ DAG (of Dance 2 Trance) first played a harder, deeper style of acid house that became popular worldwide over the next decade as Trance music. Some of the early and most influential Eurodance, Trance and Techno acts, e.g., La Bouche, Jam and Spoon, Magic Affair, Culture Beat, Snap!, Dance 2 Trance, Oliver Lieb and Hardfloor, and record labels such as Harthouse and Eye Q, were based in the city in the early 1990s. Frankfurt is home to two major botanical gardens. \n Palmengarten — Located in the Westend district, it is Hesse's largest botanical garden covering 22 ha. It opened to the public in 1871. The botanical exhibits are organized according to their origin in free-air or in greenhouses that host tropical and subtropical plants, hence the name Palm Garden. \n Botanischer Garten der Goethe-Universität — The university's botanical garden is also an arboretum. It contains about 5,000 species, with special collections of Rubus (45 species) and indigenous plants of central Europe. It is organized into two major areas: The geobotanical area contains an alpine garden, arboretum, meadows, steppes, marsh, and a pond, as well as collections of plants from the Canary Islands, Caucasus, East Asia, Mediterranean, and North America and the systematic and ecological collection includes crop plants, endangered species, ornamental plants, roses, and the Neuer Senckenbergischer Arzneipflanzengarten (New Senckenberg Medicinal Plant Garden, 1200 m²). The Botanical Garden, the neighbouring Palmengarten and the neighbouring Grüneburgpark form the largest inner-city green area."
        }
      ],
      "photoLinks": [
        {
          "id": 0,
          "title": "Frankfurt Then and Now",
          "link": "http://i.dailymail.co.uk/i/pix/2015/05/04/12/284BC0B600000578-0-image-a-27_1430738681166.jpg"
        },
        {
          "id": 1,
          "title": "Nextower",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Frankfurt_Nextower.20130514.jpg/323px-Frankfurt_Nextower.20130514.jpg"
        },
        {
          "id": 2,
          "title": "City Hall",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Frankfurter_R%C3%B6mer.jpg/320px-Frankfurter_R%C3%B6mer.jpg"
        },
        {
          "id": 3,
          "title": "Frankfurt Central Train Station",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Frankfurt_Main_Hauptbahnhof_6229.jpg/320px-Frankfurt_Main_Hauptbahnhof_6229.jpg"
        },
        {
          "id": 4,
          "title": "City Seal",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Wappen_Frankfurt_am_Main.svg/219px-Wappen_Frankfurt_am_Main.svg.png"
        }
      ]
    },
    {
      "id": 7,
      "cityName": "Amsterdam",
      "latitude": 52.3746999,
      "longtitude": 4.6184338,
      "description": [
        {
          "general": "Amsterdamis the capital and most populous municipality of the Kingdom of the Netherlands. Its status as the capital is mandated by the Constitution of the Netherlands, although it is not the seat of the government, which is The Hague. Amsterdam has a population of 851,373 within the city proper, 1,351,587 in the urban area,  and 2,410,960 in the Amsterdam metropolitan area. The city is located in the province of North Holland in the west of the country. The metropolitan area comprises much of the northern part of the Randstad, one of the larger conurbations in Europe, with a population of approximately 7 million. Famous Amsterdam residents include the diarist Anne Frank, artists Rembrandt van Rijn and Vincent van Gogh, and philosopher Baruch Spinoza.",
          "history": "Amsterdam is much younger than Dutch cities such as Nijmegen, Rotterdam, and Utrecht. In October 2008, historical geographer Chris de Bont suggested that the land around Amsterdam was being reclaimed as early as the late 10th century. This does not necessarily mean that there was already a settlement then, since reclamation of land may not have been for farming—it may have been for peat, for use as fuel. In the 16th century, the Dutch rebelled against Philip II of Spain and his successors. The main reasons for the uprising were the imposition of new taxes, the tenth penny, and the religious persecution of Protestants by the newly introduced Inquisition. The revolt escalated into the Eighty Years' War, which ultimately led to Dutch independence. Strongly pushed by Dutch Revolt leader William the Silent, the Dutch Republic became known for its relative religious tolerance. Jews from the Iberian Peninsula, Huguenots from France, prosperous merchants and printers from Flanders, and economic and religious refugees from the Spanish-controlled parts of the Low Countries found safety in Amsterdam. The influx of Flemish printers and the city's intellectual tolerance made Amsterdam a centre for the European free press. The 17th century is considered Amsterdam's Golden Age, during which it became the wealthiest city in the world. Ships sailed from Amsterdam to the Baltic Sea, North America, and Africa, as well as present-day Indonesia, India, Sri Lanka, and Brazil, forming the basis of a worldwide trading network. Amsterdam's merchants had the largest share in both the Dutch East India Company and the Dutch West India Company. These companies acquired overseas possessions that later became Dutch colonies. Amsterdam was Europe's most important point for the shipment of goods and was the leading Financial centre of the world. In 1602, the Amsterdam office of the international trading Dutch East India Company became the world's first stock exchange by trading in its own shares.[35] The Bank of Amsterdam started operations in 1609, acting as a full service bank for Dutch merchant bankers and as a reserve bank. Amsterdam's prosperity declined during the 18th and early 19th centuries. The wars of the Dutch Republic with England and France took their toll on Amsterdam. During the Napoleonic Wars, Amsterdam's significance reached its lowest point, with Holland being absorbed into the French Empire. However, the later establishment of the United Kingdom of the Netherlands in 1815 marked a turning point. The end of the 19th century is sometimes called Amsterdam's second Golden Age. New museums, a railway station, and the Concertgebouw were built; in this same time, the Industrial Revolution reached the city. The Amsterdam–Rhine Canal was dug to give Amsterdam a direct connection to the Rhine, and the North Sea Canal was dug to give the port a shorter connection to the North Sea. Both projects dramatically improved commerce with the rest of Europe and the world. In 1906, Joseph Conrad gave a brief description of Amsterdam as seen from the seaside, in The Mirror of the Sea. In the early years of the 21st century, the Amsterdam city centre has attracted large numbers of tourists: between 2012 and 2015, the annual number of visitors rose from 10 million to 17 million. Real estate prices have surged, and local shops are making way for tourist-oriented ones, making the centre unaffordable for the city's inhabitants. These developments have evoked comparisons with Venice, a city thought to be overwhelmed by the tourist influx.",
          "geography": "Amsterdam is in the western Netherlands, in the province of North Holland. The river Amstel ends in the city centre and connects to a large number of canals that eventually terminate in the IJ. Amsterdam is about 2 metres (6.6 feet) below sea level. The surrounding land is flat as it is formed of large polders. A man-made forest, Amsterdamse Bos, is in the southwest. Amsterdam is connected to the North Sea through the long North Sea Canal. Amsterdam is intensely urbanised, as is the Amsterdam Metropolitan Area surrounding the city. Comprising 219.4 square kilometres (84.7 square miles) of land, the city proper has 4,457 inhabitants per km2 and 2,275 houses per km2. Parks and nature reserves make up 12% of Amsterdam's land area. Amsterdam has more than 100 kilometres (60 miles) of canals, most of which are navigable by boat. The three main canals are Prinsengracht, Herengracht, and Keizersgracht. In the Middle Ages, Amsterdam was surrounded by a moat, called the Singel, which now forms the innermost ring in the city, and makes the city centre a horseshoe shape. The city is also served by a seaport. It has been compared with Venice, due to its division into about 90 islands, which are linked by more than 1,200 bridges.",
          "climate": "Amsterdam has an oceanic climate (Köppen climate classification Cfb) strongly influenced by its proximity to the North Sea to the west, with prevailing westerly winds. Both winters and summers are considered mild, although occasionally quite cool. Amsterdam, as well as most of the North Holland province, lies in USDA Hardiness zone 8b. Frosts mainly occur during spells of easterly or northeasterly winds from the inner European continent. Even then, because Amsterdam is surrounded on three sides by large bodies of water, as well as having a significant heat-island effect, nights rarely fall below −5 °C (23 °F), while it could easily be −12 °C (10 °F) in Hilversum, 25 kilometres (16 miles) southeast. Summers are moderately warm but rarely hot. The average daily high in August is 22.1 °C (71.8 °F), and 30 °C (86 °F) or higher is only measured on average on 2.5 days, placing Amsterdam in AHS Heat Zone 2. The record extremes range from −24 °C (−11 °F) to 36.8 °C (98.2 °F). Days with more than 1 millimetre (0.04 in) of precipitation are common, on average 133 days per year. Amsterdam's average annual precipitation is 838 millimetres (33 in),[57] more than what is measured at Amsterdam Schiphol Airport. A large part of this precipitation falls as light rain or brief showers. Cloudy and damp days are common during the cooler months of October through March.",
          "culture": "During the later part of the 16th-century Amsterdam's Rederijkerskamer (Chamber of rhetoric) organised contests between different Chambers in the reading of poetry and drama. In 1638, Amsterdam opened its first theatre. Ballet performances were given in this theatre as early as 1642. In the 18th century, French theatre became popular. While Amsterdam was under the influence of German music in the 19th century there were few national opera productions; the Hollandse Opera of Amsterdam was built in 1888 for the specific purpose of promoting Dutch opera. In the 19th century, popular culture was centred on the Nes area in Amsterdam (mainly vaudeville and music-hall). The metronome, one of the most important advances in European classical music, was invented here in 1812 by Dietrich Nikolaus Winkel. At the end of this century, the Rijksmuseum and Stedelijk Museum were built. In 1888, the Concertgebouworkest was established. With the 20th century came cinema, radio and television. Though most studios are located in Hilversum and Aalsmeer, Amsterdam's influence on programming is very strong. Many people who work in the television industry live in Amsterdam. Also, the headquarters of the Dutch SBS Broadcasting Group is located in Amsterdam. The most important museums of Amsterdam are located on the Museumplein (Museum Square), located at the southwestern side of the Rijksmuseum. It was created in the last quarter of the 19th century on the grounds of the former World's fair. The northeastern part of the square is bordered by the very large Rijksmuseum. In front of the Rijksmuseum on the square itself is a long, rectangular pond. This is transformed into an ice rink in winter. The northwestern part of the square is bordered by the Van Gogh Museum, Stedelijk Museum, House of Bols Cocktail & Genever Experience and Coster Diamonds. The southwestern border of the Museum Square is the Van Baerlestraat, which is a major thoroughfare in this part of Amsterdam. The Concertgebouw is situated across this street from the square. To the southeast of the square are situated a number of large houses, one of which contains the American consulate. A parking garage can be found underneath the square, as well as a supermarket. The Museumplein is covered almost entirely with a lawn, except for the northeastern part of the square which is covered with gravel. The current appearance of the square was realised in 1999, when the square was remodelled. The square itself is the most prominent site in Amsterdam for festivals and outdoor concerts, especially in the summer. Plans were made in 2008 to remodel the square again, because many inhabitants of Amsterdam are not happy with its current appearance. Amsterdam is famous for its vibrant and diverse nightlife. Amsterdam has many cafés (bars). They range from large and modern to small and cozy. The typical Bruine Kroeg (brown café) breathe a more old fashioned atmosphere with dimmed lights, candles, and somewhat older clientele. Most cafés have terraces in summertime. A common sight on the Leidseplein during summer is a square full of terraces packed with people drinking beer or wine. Many restaurants can be found in Amsterdam as well. Since Amsterdam is a multicultural city, a lot of different ethnic restaurants can be found. Restaurants range from being rather luxurious and expensive to being ordinary and affordable. Amsterdam also possesses many discothèques. The two main nightlife areas for tourists are the Leidseplein and the Rembrandtplein. The Paradiso, Melkweg and Sugar Factory are cultural centres, which turn into discothèques on some nights. Examples of discothèques near the Rembrandtplein are the Escape, Air, John Doe and Club Abe. Also noteworthy are Panama, Hotel Arena (East), TrouwAmsterdam and Studio 80. Bimhuis located near the Central Station, with its rich programming hosting the best in the field is considered one of the best jazz clubs in the world. The Reguliersdwarsstraat is the main street for the LGBT community and nightlife."
        }
      ],
      "photoLinks": [
        {
          "id": 0,
          "title": "Rijksu Museum Amserdam",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/RijksmuseumAmsterdamMuseumplein2.50%2C1.jpg/320px-RijksmuseumAmsterdamMuseumplein2.50%2C1.jpg"
        },
        {
          "id": 1,
          "title": "Paleis op de Dam",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Paleis_op_de_dam.JPG/320px-Paleis_op_de_dam.JPG"
        },
        {
          "id": 2,
          "title": "Replica Voc Schip",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Replica_VOC-schip_Amsterdam.jpg/320px-Replica_VOC-schip_Amsterdam.jpg"
        },
        {
          "id": 3,
          "title": "Basilica of St. Nicholas",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/The_Church_of_St_Nicholas.jpg/320px-The_Church_of_St_Nicholas.jpg"
        },
        {
          "id": 4,
          "title": "City Seal",
          "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Wapen_van_Amsterdam.svg/320px-Wapen_van_Amsterdam.svg.png"
        }
      ]
    }
  ]
}
